
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВыдачаДокументов.ПолучитьМакет("Печать1");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыдачаДокументов.Дата,
	|	ВыдачаДокументов.Номер,
	|	ВыдачаДокументов.Ответственный,
	|	ВыдачаДокументов.ПолучательДокументов,
	|	ВыдачаДокументов.ВыдачаДокументов.(
	|		НомерСтроки,
	|		Документ,
	|		Количество,
	|		Готовность,
	|		ДатаГотовности,
	|		СпособВыдачи,
	|		Выдача,
	|		ДатаВыдачи
	|	),
	|	ВыдачаДокументов.ПолучениеДокументовОтТуриста.(
	|		Турист,
	|		КоличествоЧеловек,
	|		ДетиВПаспорте
	|	)
	|ИЗ
	|	Документ.ВыдачаДокументов КАК ВыдачаДокументов
	|ГДЕ
	|	ВыдачаДокументов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыдачаДокументовШапка = Макет.ПолучитьОбласть("ВыдачаДокументовШапка");
	ОбластьВыдачаДокументов = Макет.ПолучитьОбласть("ВыдачаДокументов");
	ОбластьПолучениеДокументовОтТуристаШапка = Макет.ПолучитьОбласть("ПолучениеДокументовОтТуристаШапка");
	ОбластьПолучениеДокументовОтТуриста = Макет.ПолучитьОбласть("ПолучениеДокументовОтТуриста");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыдачаДокументовШапка);
		ВыборкаВыдачаДокументов = Выборка.ВыдачаДокументов.Выбрать();
		Пока ВыборкаВыдачаДокументов.Следующий() Цикл
			ОбластьВыдачаДокументов.Параметры.Заполнить(ВыборкаВыдачаДокументов);
			ТабДок.Вывести(ОбластьВыдачаДокументов, ВыборкаВыдачаДокументов.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПолучениеДокументовОтТуристаШапка);
		ВыборкаПолучениеДокументовОтТуриста = Выборка.ПолучениеДокументовОтТуриста.Выбрать();
		Пока ВыборкаПолучениеДокументовОтТуриста.Следующий() Цикл
			ОбластьПолучениеДокументовОтТуриста.Параметры.Заполнить(ВыборкаПолучениеДокументовОтТуриста);
			ТабДок.Вывести(ОбластьПолучениеДокументовОтТуриста, ВыборкаПолучениеДокументовОтТуриста.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
