
Процедура Печатьдоговора(ТабДок, Ссылка) Экспорт
	Макет = Документы.Продажи.ПолучитьМакет("Макет");
	
	ШапкаОбласть =  Макет.ПолучитьОбласть("Шапка");
	ОстальноеОбласть = Макет.ПолучитьОбласть("Остальное");
	РеквизитыОбласть = Макет.ПолучитьОбласть("РеквизитыСторон");
	
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Продажи.Сотрудник.Наименование КАК СотрудникНаименование,
	|	Продажи.Клиент.Наименование КАК КлиентНаименование,
	|	Продажи.Клиент.СерияНомерПаспорта КАК КлиентСерияНомерПаспорта,
	|	Продажи.Клиент.КемВыдан КАК КлиентКемВыдан,
	|	Продажи.Клиент.ДатаВыдачи КАК КлиентДатаВыдачи,
	|	Продажи.Клиент.Телефон КАК КлиентТелефон
	|ИЗ
	|	Документ.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок.Очистить();
	
	Если Выборка.Следующий() Тогда 
		ШапкаОбласть.Параметры.Турагент = Выборка.СотрудникНаименование;
		ШапкаОбласть.Параметры.ФИОКлиента = Выборка.КлиентНаименование;
		ТабДок.Вывести(ШапкаОбласть);
		
		ТабДок.Вывести(ОстальноеОбласть);
		
		РеквизитыОбласть.Параметры.ФИО = Выборка.КлиентНаименование;
		РеквизитыОбласть.Параметры.Паспорт =  Строка(Выборка.КлиентСерияНомерПаспорта+" "+Выборка.КлиентКемВыдан+" "+Формат(Выборка.КлиентДатаВыдачи,"ДФ=dd.MM.yyyy"));
		РеквизитыОбласть.Параметры.Телефон = Строка(Выборка.КлиентТелефон);
		РеквизитыОбласть.Параметры.ФИОСотрудника = Выборка.СотрудникНаименование;
		ТабДок.Вывести(РеквизитыОбласть);
	КонецЕсли;

КонецПроцедуры
