Процедура ОбработкаЗаполнения (ДанныеЗаполнения)
	//{{_КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повтороном использовании конструктора, внесенные вречную изменения будут учтены
	Если ТипЗнч (ДанныеЗаполнения) = Тип ("СправочникСсылка.ТуристическиеПрограммы") Тогда
		// Заполнение шапки
		Город = ДанныеЗаполнения.Город;
		НазваниеТура = ДанныеЗаполнения.Ссылка;
		Цена = ДанныеЗаполнения.Цена;
	КонецЕсли;
	//}}_КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи Расход
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Услуги = НазваниеТура;
	Движение.Клиенты = Клиент;
	Движение.Сотрудники = Сотрудник;
	Движение.Цена = Цена;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
