
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать договора)
	ТабДок = Новый ТабличныйДокумент;
	Печатьдоговора(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Печатьдоговора(ТабДок, ПараметрКоманды)
	Документы.Продажи.Печатьдоговора(ТабДок, ПараметрКоманды);
КонецПроцедуры
